{"class_name": "Tokenizer", "config": {"num_words": 2000, "filters": "!\"#$%&()*+,-./:;<=>?@[\\]^_`{|}~\t\n", "lower": true, "split": " ", "char_level": false, "oov_token": "<OOV>", "document_count": 54, "word_counts": "{\"what's\": 1, \"up\": 1, \"how\": 8, \"do\": 10, \"you\": 37, \"how's\": 1, \"everything\": 1, \"good\": 1, \"morning\": 1, \"evening\": 1, \"afternoon\": 1, \"night\": 1, \"hello\": 1, \"thank\": 3, \"goodbye\": 1, \"are\": 10, \"doing\": 1, \"going\": 1, \"feeling\": 1, \"alright\": 1, \"thanks\": 2, \"a\": 5, \"lot\": 1, \"i\": 5, \"appreciate\": 1, \"it\": 2, \"so\": 1, \"much\": 1, \"many\": 3, \"tell\": 2, \"me\": 6, \"something\": 1, \"can\": 9, \"help\": 3, \"what\": 11, \"assist\": 1, \"with\": 3, \"have\": 3, \"question\": 1, \"could\": 2, \"problem\": 1, \"is\": 4, \"your\": 3, \"name\": 3, \"call\": 1, \"yourself\": 1, \"who\": 5, \"exactly\": 1, \"human\": 1, \"robot\": 1, \"where\": 4, \"live\": 1, \"reside\": 1, \"find\": 1, \"made\": 1, \"programmed\": 1, \"developer\": 1, \"who's\": 1, \"boss\": 1, \"brought\": 1, \"into\": 1, \"existence\": 1, \"day\": 1, \"today\": 1, \"the\": 3, \"time\": 2, \"old\": 1, \"when\": 1, \"were\": 1, \"born\": 1, \"created\": 1, \"long\": 1, \"been\": 1, \"around\": 1, \"my\": 3, \"data\": 4, \"happens\": 2, \"to\": 3, \"information\": 1, \"give\": 1, \"save\": 2, \"say\": 1, \"which\": 1, \"languages\": 2, \"speak\": 1, \"fluent\": 1, \"in\": 1, \"any\": 1, \"other\": 1, \"people\": 1, \"talk\": 1, \"at\": 2, \"once\": 2, \"conversations\": 1, \"handle\": 1}", "word_docs": "{\"how\": 8, \"up\": 1, \"you\": 37, \"what's\": 1, \"do\": 8, \"everything\": 1, \"how's\": 1, \"evening\": 1, \"morning\": 1, \"night\": 1, \"afternoon\": 1, \"good\": 1, \"hello\": 1, \"thank\": 3, \"goodbye\": 1, \"are\": 10, \"going\": 1, \"doing\": 1, \"feeling\": 1, \"alright\": 1, \"a\": 5, \"lot\": 1, \"thanks\": 2, \"i\": 5, \"appreciate\": 1, \"it\": 2, \"much\": 1, \"so\": 1, \"many\": 3, \"something\": 1, \"tell\": 2, \"me\": 6, \"help\": 3, \"can\": 9, \"what\": 11, \"assist\": 1, \"with\": 3, \"question\": 1, \"have\": 3, \"problem\": 1, \"could\": 2, \"name\": 3, \"your\": 3, \"is\": 4, \"yourself\": 1, \"call\": 1, \"exactly\": 1, \"who\": 5, \"human\": 1, \"robot\": 1, \"where\": 4, \"live\": 1, \"reside\": 1, \"find\": 1, \"made\": 1, \"programmed\": 1, \"developer\": 1, \"who's\": 1, \"boss\": 1, \"brought\": 1, \"into\": 1, \"existence\": 1, \"day\": 1, \"today\": 1, \"the\": 3, \"time\": 2, \"old\": 1, \"created\": 1, \"born\": 1, \"were\": 1, \"when\": 1, \"around\": 1, \"been\": 1, \"long\": 1, \"data\": 4, \"my\": 3, \"to\": 3, \"happens\": 2, \"information\": 1, \"give\": 1, \"say\": 1, \"save\": 2, \"speak\": 1, \"languages\": 2, \"which\": 1, \"fluent\": 1, \"any\": 1, \"other\": 1, \"in\": 1, \"once\": 2, \"at\": 2, \"talk\": 1, \"people\": 1, \"conversations\": 1, \"handle\": 1}", "index_docs": "{\"7\": 8, \"36\": 1, \"2\": 37, \"35\": 1, \"4\": 8, \"38\": 1, \"37\": 1, \"41\": 1, \"40\": 1, \"43\": 1, \"42\": 1, \"39\": 1, \"44\": 1, \"15\": 3, \"45\": 1, \"5\": 10, \"47\": 1, \"46\": 1, \"48\": 1, \"49\": 1, \"9\": 5, \"50\": 1, \"25\": 2, \"10\": 5, \"51\": 1, \"26\": 2, \"53\": 1, \"52\": 1, \"16\": 3, \"54\": 1, \"27\": 2, \"8\": 6, \"17\": 3, \"6\": 9, \"3\": 11, \"55\": 1, \"18\": 3, \"56\": 1, \"19\": 3, \"57\": 1, \"28\": 2, \"21\": 3, \"20\": 3, \"12\": 4, \"59\": 1, \"58\": 1, \"60\": 1, \"11\": 5, \"61\": 1, \"62\": 1, \"13\": 4, \"63\": 1, \"64\": 1, \"65\": 1, \"66\": 1, \"67\": 1, \"68\": 1, \"69\": 1, \"70\": 1, \"71\": 1, \"72\": 1, \"73\": 1, \"74\": 1, \"75\": 1, \"22\": 3, \"29\": 2, \"76\": 1, \"80\": 1, \"79\": 1, \"78\": 1, \"77\": 1, \"83\": 1, \"82\": 1, \"81\": 1, \"14\": 4, \"23\": 3, \"24\": 3, \"30\": 2, \"84\": 1, \"85\": 1, \"86\": 1, \"31\": 2, \"88\": 1, \"32\": 2, \"87\": 1, \"89\": 1, \"91\": 1, \"92\": 1, \"90\": 1, \"34\": 2, \"33\": 2, \"94\": 1, \"93\": 1, \"95\": 1, \"96\": 1}", "index_word": "{\"1\": \"<OOV>\", \"2\": \"you\", \"3\": \"what\", \"4\": \"do\", \"5\": \"are\", \"6\": \"can\", \"7\": \"how\", \"8\": \"me\", \"9\": \"a\", \"10\": \"i\", \"11\": \"who\", \"12\": \"is\", \"13\": \"where\", \"14\": \"data\", \"15\": \"thank\", \"16\": \"many\", \"17\": \"help\", \"18\": \"with\", \"19\": \"have\", \"20\": \"your\", \"21\": \"name\", \"22\": \"the\", \"23\": \"my\", \"24\": \"to\", \"25\": \"thanks\", \"26\": \"it\", \"27\": \"tell\", \"28\": \"could\", \"29\": \"time\", \"30\": \"happens\", \"31\": \"save\", \"32\": \"languages\", \"33\": \"at\", \"34\": \"once\", \"35\": \"what's\", \"36\": \"up\", \"37\": \"how's\", \"38\": \"everything\", \"39\": \"good\", \"40\": \"morning\", \"41\": \"evening\", \"42\": \"afternoon\", \"43\": \"night\", \"44\": \"hello\", \"45\": \"goodbye\", \"46\": \"doing\", \"47\": \"going\", \"48\": \"feeling\", \"49\": \"alright\", \"50\": \"lot\", \"51\": \"appreciate\", \"52\": \"so\", \"53\": \"much\", \"54\": \"something\", \"55\": \"assist\", \"56\": \"question\", \"57\": \"problem\", \"58\": \"call\", \"59\": \"yourself\", \"60\": \"exactly\", \"61\": \"human\", \"62\": \"robot\", \"63\": \"live\", \"64\": \"reside\", \"65\": \"find\", \"66\": \"made\", \"67\": \"programmed\", \"68\": \"developer\", \"69\": \"who's\", \"70\": \"boss\", \"71\": \"brought\", \"72\": \"into\", \"73\": \"existence\", \"74\": \"day\", \"75\": \"today\", \"76\": \"old\", \"77\": \"when\", \"78\": \"were\", \"79\": \"born\", \"80\": \"created\", \"81\": \"long\", \"82\": \"been\", \"83\": \"around\", \"84\": \"information\", \"85\": \"give\", \"86\": \"say\", \"87\": \"which\", \"88\": \"speak\", \"89\": \"fluent\", \"90\": \"in\", \"91\": \"any\", \"92\": \"other\", \"93\": \"people\", \"94\": \"talk\", \"95\": \"conversations\", \"96\": \"handle\"}", "word_index": "{\"<OOV>\": 1, \"you\": 2, \"what\": 3, \"do\": 4, \"are\": 5, \"can\": 6, \"how\": 7, \"me\": 8, \"a\": 9, \"i\": 10, \"who\": 11, \"is\": 12, \"where\": 13, \"data\": 14, \"thank\": 15, \"many\": 16, \"help\": 17, \"with\": 18, \"have\": 19, \"your\": 20, \"name\": 21, \"the\": 22, \"my\": 23, \"to\": 24, \"thanks\": 25, \"it\": 26, \"tell\": 27, \"could\": 28, \"time\": 29, \"happens\": 30, \"save\": 31, \"languages\": 32, \"at\": 33, \"once\": 34, \"what's\": 35, \"up\": 36, \"how's\": 37, \"everything\": 38, \"good\": 39, \"morning\": 40, \"evening\": 41, \"afternoon\": 42, \"night\": 43, \"hello\": 44, \"goodbye\": 45, \"doing\": 46, \"going\": 47, \"feeling\": 48, \"alright\": 49, \"lot\": 50, \"appreciate\": 51, \"so\": 52, \"much\": 53, \"something\": 54, \"assist\": 55, \"question\": 56, \"problem\": 57, \"call\": 58, \"yourself\": 59, \"exactly\": 60, \"human\": 61, \"robot\": 62, \"live\": 63, \"reside\": 64, \"find\": 65, \"made\": 66, \"programmed\": 67, \"developer\": 68, \"who's\": 69, \"boss\": 70, \"brought\": 71, \"into\": 72, \"existence\": 73, \"day\": 74, \"today\": 75, \"old\": 76, \"when\": 77, \"were\": 78, \"born\": 79, \"created\": 80, \"long\": 81, \"been\": 82, \"around\": 83, \"information\": 84, \"give\": 85, \"say\": 86, \"which\": 87, \"speak\": 88, \"fluent\": 89, \"in\": 90, \"any\": 91, \"other\": 92, \"people\": 93, \"talk\": 94, \"conversations\": 95, \"handle\": 96}"}}